SoCXin/HC32F460/src/hc32f460_ddl_Rev2.0.0/example/ev_hc32f460_lqfp100_v2/exint_nmi_swi/source/main.c
/*******************************************************************************
 * Copyright (C) 2020, Huada Semiconductor Co., Ltd. All rights reserved.
 *
 * This software component is licensed by HDSC under BSD 3-Clause license
 * (the "License"); You may not use this file except in compliance with the
 * License. You may obtain a copy of the License at:
 *                    opensource.org/licenses/BSD-3-Clause
 */
/******************************************************************************/
/** \file main.c
 **
 ** \brief The example for EXTI, NMI and SWI function demonstration
 **
 **   - 2021-04-16 CDT First version for sample of exint_nmi_swi module.
 **
 ******************************************************************************/

/*******************************************************************************
 * Include files
 ******************************************************************************/
#include "hc32_ddl.h"

/*******************************************************************************
 * Local type definitions ('typedef')
 ******************************************************************************/

/*******************************************************************************
 * Local pre-processor symbols/macros ('#define')
 ******************************************************************************/
/* KEY10 */
#define  KEY10_PORT       (PortB)
#define  KEY10_PIN        (Pin01)

/*******************************************************************************
 * Global variable definitions (declared in header file with 'extern')
 ******************************************************************************/

/*******************************************************************************
 * Local function prototypes ('static')
 ******************************************************************************/

/*******************************************************************************
 * Local variable definitions ('static')
 ******************************************************************************/
static uint32_t u32NmiCount = 0ul;
static uint32_t u32ExtInt00Count = 0ul;
static uint32_t u32ExtInt01Count = 0ul;
static uint32_t u32ExtInt02Count = 0ul;
static uint32_t u32ExtInt03Count = 0ul;
static uint32_t u32ExtInt04Count = 0ul;
static uint32_t u32ExtInt05Count = 0ul;
static uint32_t u32ExtInt06Count = 0ul;
static uint32_t u32ExtInt07Count = 0ul;
static uint32_t u32ExtInt08Count = 0ul;
static uint32_t u32ExtInt09Count = 0ul;
static uint32_t u32ExtInt10Count = 0ul;
static uint32_t u32ExtInt11Count = 0ul;
static uint32_t u32ExtInt12Count = 0ul;
static uint32_t u32ExtInt13Count = 0ul;
static uint32_t u32ExtInt14Count = 0ul;
static uint32_t u32ExtInt15Count = 0ul;
static uint32_t u32SWI00Count = 0ul;
static uint32_t u32SWI01Count = 0ul;
static uint32_t u32SWI02Count = 0ul;
static uint32_t u32SWI03Count = 0ul;
static uint32_t u32SWI04Count = 0ul;
static uint32_t u32SWI05Count = 0ul;
static uint32_t u32SWI06Count = 0ul;
static uint32_t u32SWI07Count = 0ul;
static uint32_t u32SWI08Count = 0ul;
static uint32_t u32SWI09Count = 0ul;
static uint32_t u32SWI10Count = 0ul;
static uint32_t u32SWI11Count = 0ul;
static uint32_t u32SWI12Count = 0ul;
static uint32_t u32SWI13Count = 0ul;
static uint32_t u32SWI14Count = 0ul;
static uint32_t u32SWI15Count = 0ul;
static uint32_t u32SWI16Count = 0ul;
static uint32_t u32SWI17Count = 0ul;
static uint32_t u32SWI18Count = 0ul;
static uint32_t u32SWI19Count = 0ul;
static uint32_t u32SWI20Count = 0ul;
static uint32_t u32SWI21Count = 0ul;
static uint32_t u32SWI22Count = 0ul;
static uint32_t u32SWI23Count = 0ul;
static uint32_t u32SWI24Count = 0ul;
static uint32_t u32SWI25Count = 0ul;
static uint32_t u32SWI26Count = 0ul;
static uint32_t u32SWI27Count = 0ul;
static uint32_t u32SWI28Count = 0ul;
static uint32_t u32SWI29Count = 0ul;
static uint32_t u32SWI30Count = 0ul;
static uint32_t u32SWI31Count = 0ul;
/*******************************************************************************
 * Function implementation - global ('extern') and local ('static')
 ******************************************************************************/
/**
 *******************************************************************************
 ** \brief ExtInt00 callback function
 **
 ** \param  None
 **
 ** \retval None
 **
 ******************************************************************************/
void ExtInt00_Callback(void)
{
    if (Set == EXINT_IrqFlgGet(ExtiCh00))
    {
        u32ExtInt00Count++;

        /* clear int request flag */
        EXINT_IrqFlgClr(ExtiCh00);
    }
}

/**
 *******************************************************************************
 ** \brief ExtInt01 callback function
 **
 ** \param  None
 **
 ** \retval None
 **
 ******************************************************************************/
void ExtInt01_Callback(void)
{
    if (Set == EXINT_IrqFlgGet(ExtiCh01))
    {
        u32ExtInt01Count++;

        BSP_LED_Toggle(LED_RED);
        DDL_Printf("External interrupt 01(KEY10) interrupt occurrence: %ld\n", u32ExtInt01Count);
        /* clear int request flag */
        EXINT_IrqFlgClr(ExtiCh01);
    }
}

/**
 *******************************************************************************
 ** \brief ExtInt02 callback function
 **
 ** \param  None
 **
 ** \retval None
 **
 ******************************************************************************/
void ExtInt02_Callback(void)
{
    if (Set == EXINT_IrqFlgGet(ExtiCh02))
    {
        u32ExtInt02Count++;

        /* clear int request flag */
        EXINT_IrqFlgClr(ExtiCh02);
    }
}

/**
 *******************************************************************************
 ** \brief ExtInt03 callback function
 **
 ** \param  None
 **
 ** \retval None
 **
 ******************************************************************************/
void ExtInt03_Callback(void)
{
    if (Set == EXINT_IrqFlgGet(ExtiCh03))
    {
        u32ExtInt03Count++;

        /* clear int request flag */
        EXINT_IrqFlgClr(ExtiCh03);
    }
}

/**
 *******************************************************************************
 ** \brief ExtInt04 callback function
 **
 ** \param  None
 **
 ** \retval None
 **
 ******************************************************************************/
void ExtInt04_Callback(void)
{
    if (Set == EXINT_IrqFlgGet(ExtiCh04))
    {
        u32ExtInt04Count++;

        /* clear int request flag */
        EXINT_IrqFlgClr(ExtiCh04);
    }
}

/**
 *******************************************************************************
 ** \brief ExtInt05 callback function
 **
 ** \param  None
 **
 ** \retval None
 **
 ******************************************************************************/
void ExtInt05_Callback(void)
{
    if (Set == EXINT_IrqFlgGet(ExtiCh05))
    {
        u32ExtInt05Count++;

        /* clear int request flag */
        EXINT_IrqFlgClr(ExtiCh05);
    }

