SoCXin/HC32F460/src/hc32f460_ddl_Rev2.0.0/example/ev_hc32f460_lqfp100_v2/exint_nmi_swi/source/main.c
}

/**
 *******************************************************************************
 ** \brief ExtInt06 callback function
 **
 ** \param  None
 **
 ** \retval None
 **
 ******************************************************************************/
void ExtInt06_Callback(void)
{
    if (Set == EXINT_IrqFlgGet(ExtiCh06))
    {
        u32ExtInt06Count++;

        /* clear int request flag */
        EXINT_IrqFlgClr(ExtiCh06);
    }
}

/**
 *******************************************************************************
 ** \brief ExtInt07 callback function
 **
 ** \param  None
 **
 ** \retval None
 **
 ******************************************************************************/
void ExtInt07_Callback(void)
{
    if (Set == EXINT_IrqFlgGet(ExtiCh07))
    {
        u32ExtInt07Count++;

        /* clear int request flag */
        EXINT_IrqFlgClr(ExtiCh07);
    }
}

/**
 *******************************************************************************
 ** \brief ExtInt08 callback function
 **
 ** \param  None
 **
 ** \retval None
 **
 ******************************************************************************/
void ExtInt08_Callback(void)
{
    if (Set == EXINT_IrqFlgGet(ExtiCh08))
    {
        u32ExtInt08Count++;

        /* clear int request flag */
        EXINT_IrqFlgClr(ExtiCh08);
    }
}

/**
 *******************************************************************************
 ** \brief ExtInt09 callback function
 **
 ** \param  None
 **
 ** \retval None
 **
 ******************************************************************************/
void ExtInt09_Callback(void)
{
    if (Set == EXINT_IrqFlgGet(ExtiCh09))
    {
        u32ExtInt09Count++;

        /* clear int request flag */
        EXINT_IrqFlgClr(ExtiCh09);
    }
}

/**
 *******************************************************************************
 ** \brief ExtInt10 callback function
 **
 ** \param  None
 **
 ** \retval None
 **
 ******************************************************************************/
void ExtInt10_Callback(void)
{
    if (Set == EXINT_IrqFlgGet(ExtiCh10))
    {
        u32ExtInt10Count++;

        /* clear int request flag */
        EXINT_IrqFlgClr(ExtiCh10);
    }
}

/**
 *******************************************************************************
 ** \brief ExtInt11 callback function
 **
 ** \param  None
 **
 ** \retval None
 **
 ******************************************************************************/
void ExtInt11_Callback(void)
{
    if (Set == EXINT_IrqFlgGet(ExtiCh11))
    {
        u32ExtInt11Count++;

        /* clear int request flag */
        EXINT_IrqFlgClr(ExtiCh11);
    }
}

/**
 *******************************************************************************
 ** \brief ExtInt12 callback function
 **
 ** \param  None
 **
 ** \retval None
 **
 ******************************************************************************/
void ExtInt12_Callback(void)
{
    if (Set == EXINT_IrqFlgGet(ExtiCh12))
    {
        u32ExtInt12Count++;

        /* clear int request flag */
        EXINT_IrqFlgClr(ExtiCh12);
    }
}

/**
 *******************************************************************************
 ** \brief ExtInt13 callback function
 **
 ** \param  None
 **
 ** \retval None
 **
 ******************************************************************************/
void ExtInt13_Callback(void)
{
    if (Set == EXINT_IrqFlgGet(ExtiCh13))
    {
        u32ExtInt13Count++;

        /* clear int request flag */
        EXINT_IrqFlgClr(ExtiCh13);
    }
}

/**
 *******************************************************************************
 ** \brief ExtInt14 callback function
 **
 ** \param  None
 **
 ** \retval None
 **
 ******************************************************************************/
void ExtInt14_Callback(void)
{
    if (Set == EXINT_IrqFlgGet(ExtiCh14))
    {
        u32ExtInt14Count++;

        /* clear int request flag */
        EXINT_IrqFlgClr(ExtiCh14);
    }
}

/**
 *******************************************************************************
 ** \brief ExtInt15 callback function
 **
 ** \param  None
 **
 ** \retval None
 **
 ******************************************************************************/
void ExtInt15_Callback(void)
{

    if (Set == EXINT_IrqFlgGet(ExtiCh15))
    {
        u32ExtInt15Count++;

        /* clear int request flag */
        EXINT_IrqFlgClr(ExtiCh15);
    }
}

/**
 *******************************************************************************
 ** \brief Software interrupt Ch.00 callback function
 **
 ** \param  None
 **
 ** \retval None
 **
 ******************************************************************************/
void SWI00_Callback(void)
{
    u32SWI00Count++;

    SWI_Disable(SwiCh00);
}

/**
 *******************************************************************************
 ** \brief Software interrupt Ch.01 callback function
 **
 ** \param  None
 **
 ** \retval None
 **
 ******************************************************************************/
void SWI01_Callback(void)
{
    u32SWI01Count++;

    SWI_Disable(SwiCh01);
}

/**
 *******************************************************************************
 ** \brief Software interrupt Ch.02 callback function
 **
 ** \param  None
 **
 ** \retval None
 **
 ******************************************************************************/
void SWI02_Callback(void)
{
    u32SWI02Count++;

    SWI_Disable(SwiCh02);
}

/**
 *******************************************************************************
 ** \brief Software interrupt Ch.03 callback function
 **
 ** \param  None
 **
 ** \retval None
 **
 ******************************************************************************/
void SWI03_Callback(void)
{
    u32SWI03Count++;

    SWI_Disable(SwiCh03);
}

/**
 *******************************************************************************
 ** \brief Software interrupt Ch.04 callback function
 **
 ** \param  None
 **
 ** \retval None
 **
 ******************************************************************************/
void SWI04_Callback(void)
{
    u32SWI04Count++;

    SWI_Disable(SwiCh04);
}

/**
 *******************************************************************************
 ** \brief Software interrupt Ch.05 callback function
 **
 ** \param  None
 **
 ** \retval None
 **
 ******************************************************************************/
void SWI05_Callback(void)
{
    u32SWI05Count++;

    SWI_Disable(SwiCh05);
}

/**
 *******************************************************************************
 ** \brief Software interrupt Ch.06 callback function
 **
 ** \param  None
 **
 ** \retval None
 **
 ******************************************************************************/
void SWI06_Callback(void)
{
    u32SWI06Count++;

