SoCXin/HC32F460/src/hc32f460_ddl_Rev2.0.0/example/ev_hc32f460_lqfp100_v2/exint_nmi_swi/source/main.c
    SWI_Disable(SwiCh06);
}

/**
 *******************************************************************************
 ** \brief Software interrupt Ch.07 callback function
 **
 ** \param  None
 **
 ** \retval None
 **
 ******************************************************************************/
void SWI07_Callback(void)
{
    u32SWI07Count++;

    SWI_Disable(SwiCh07);
}

/**
 *******************************************************************************
 ** \brief Software interrupt Ch.08 callback function
 **
 ** \param  None
 **
 ** \retval None
 **
 ******************************************************************************/
void SWI08_Callback(void)
{
    u32SWI08Count++;

    SWI_Disable(SwiCh08);
}

/**
 *******************************************************************************
 ** \brief Software interrupt Ch.09 callback function
 **
 ** \param  None
 **
 ** \retval None
 **
 ******************************************************************************/
void SWI09_Callback(void)
{
    u32SWI09Count++;

    SWI_Disable(SwiCh09);
}

/**
 *******************************************************************************
 ** \brief Software interrupt Ch.10 callback function
 **
 ** \param  None
 **
 ** \retval None
 **
 ******************************************************************************/
void SWI10_Callback(void)
{
    u32SWI10Count++;

    SWI_Disable(SwiCh10);
}

/**
 *******************************************************************************
 ** \brief Software interrupt Ch.11 callback function
 **
 ** \param  None
 **
 ** \retval None
 **
 ******************************************************************************/
void SWI11_Callback(void)
{
    u32SWI11Count++;

    SWI_Disable(SwiCh11);
}

/**
 *******************************************************************************
 ** \brief Software interrupt Ch.12 callback function
 **
 ** \param  None
 **
 ** \retval None
 **
 ******************************************************************************/
void SWI12_Callback(void)
{
    u32SWI12Count++;

    SWI_Disable(SwiCh12);
}

/**
 *******************************************************************************
 ** \brief Software interrupt Ch.13 callback function
 **
 ** \param  None
 **
 ** \retval None
 **
 ******************************************************************************/
void SWI13_Callback(void)
{
    u32SWI13Count++;

    SWI_Disable(SwiCh13);
}

/**
 *******************************************************************************
 ** \brief Software interrupt Ch.14 callback function
 **
 ** \param  None
 **
 ** \retval None
 **
 ******************************************************************************/
void SWI14_Callback(void)
{
    u32SWI14Count++;

    SWI_Disable(SwiCh14);
}

/**
 *******************************************************************************
 ** \brief Software interrupt Ch.15 callback function
 **
 ** \param  None
 **
 ** \retval None
 **
 ******************************************************************************/
void SWI15_Callback(void)
{
    u32SWI15Count++;

    SWI_Disable(SwiCh15);
}

/**
 *******************************************************************************
 ** \brief Software interrupt Ch.16 callback function
 **
 ** \param  None
 **
 ** \retval None
 **
 ******************************************************************************/
void SWI16_Callback(void)
{
    u32SWI16Count++;

    SWI_Disable(SwiCh16);
}

/**
 *******************************************************************************
 ** \brief Software interrupt Ch.17 callback function
 **
 ** \param  None
 **
 ** \retval None
 **
 ******************************************************************************/
void SWI17_Callback(void)
{
    u32SWI17Count++;

    SWI_Disable(SwiCh17);
}

/**
 *******************************************************************************
 ** \brief Software interrupt Ch.18 callback function
 **
 ** \param  None
 **
 ** \retval None
 **
 ******************************************************************************/
void SWI18_Callback(void)
{
    u32SWI18Count++;

    SWI_Disable(SwiCh18);
}

/**
 *******************************************************************************
 ** \brief Software interrupt Ch.19 callback function
 **
 ** \param  None
 **
 ** \retval None
 **
 ******************************************************************************/
void SWI19_Callback(void)
{
    u32SWI19Count++;

    SWI_Disable(SwiCh19);
}

/**
 *******************************************************************************
 ** \brief Software interrupt Ch.20 callback function
 **
 ** \param  None
 **
 ** \retval None
 **
 ******************************************************************************/
void SWI20_Callback(void)
{
    u32SWI20Count++;

    SWI_Disable(SwiCh20);
}

/**
 *******************************************************************************
 ** \brief Software interrupt Ch.21 callback function
 **
 ** \param  None
 **
 ** \retval None
 **
 ******************************************************************************/
void SWI21_Callback(void)
{
    u32SWI21Count++;

    SWI_Disable(SwiCh21);
}

/**
 *******************************************************************************
 ** \brief Software interrupt Ch.22 callback function
 **
 ** \param  None
 **
 ** \retval None
 **
 ******************************************************************************/
void SWI22_Callback(void)
{
    u32SWI22Count++;

    SWI_Disable(SwiCh22);
}

/**
 *******************************************************************************
 ** \brief Software interrupt Ch.23 callback function
 **
 ** \param  None
 **
 ** \retval None
 **
 ******************************************************************************/
void SWI23_Callback(void)
{
    u32SWI23Count++;

    SWI_Disable(SwiCh23);
}

/**
 *******************************************************************************
 ** \brief Software interrupt Ch.24 callback function
 **
 ** \param  None
 **
 ** \retval None
 **
 ******************************************************************************/
void SWI24_Callback(void)
{
    u32SWI24Count++;

    SWI_Disable(SwiCh24);
}

/**
 *******************************************************************************
 ** \brief Software interrupt Ch.25 callback function
 **
 ** \param  None
 **
 ** \retval None
 **
 ******************************************************************************/
void SWI25_Callback(void)
{
    u32SWI25Count++;

    SWI_Disable(SwiCh25);
}

/**
 *******************************************************************************
 ** \brief Software interrupt Ch.26 callback function
 **
 ** \param  None
 **
 ** \retval None
 **
 ******************************************************************************/
void SWI26_Callback(void)
{
    u32SWI26Count++;

    SWI_Disable(SwiCh26);
}

/**
 *******************************************************************************
 ** \brief Software interrupt Ch.27 callback function
 **
 ** \param  None
 **
 ** \retval None
 **
 ******************************************************************************/
void SWI27_Callback(void)
{
    u32SWI27Count++;

