SoCXin/HC32F460/src/hc32f460_ddl_Rev2.0.0/example/ev_hc32f460_lqfp100_v2/exint_nmi_swi/source/main.c
    SWI_Disable(SwiCh27);
}

/**
 *******************************************************************************
 ** \brief Software interrupt Ch.28 callback function
 **
 ** \param  None
 **
 ** \retval None
 **
 ******************************************************************************/
void SWI28_Callback(void)
{
    u32SWI28Count++;

    SWI_Disable(SwiCh28);
}

/**
 *******************************************************************************
 ** \brief Software interrupt Ch.29 callback function
 **
 ** \param  None
 **
 ** \retval None
 **
 ******************************************************************************/
void SWI29_Callback(void)
{
    u32SWI29Count++;

    SWI_Disable(SwiCh29);
}

/**
 *******************************************************************************
 ** \brief Software interrupt Ch.30 callback function
 **
 ** \param  None
 **
 ** \retval None
 **
 ******************************************************************************/
void SWI30_Callback(void)
{
    u32SWI30Count++;

    SWI_Disable(SwiCh30);
}

/**
 *******************************************************************************
 ** \brief Software interrupt Ch.31 callback function
 **
 ** \param  None
 **
 ** \retval None
 **
 ******************************************************************************/
void SWI31_Callback(void)
{
    u32SWI31Count++;

    DDL_Printf("Software 31 interrupt occurrence: %ld\n", u32SWI31Count);
    SWI_Disable(SwiCh31);
}

/**
 *******************************************************************************
 ** \brief NMI ISR callback function
 **
 ** \param  None
 **
 ** \retval None
 **
 ******************************************************************************/
void Nmi_IrqCallback(void)
{
    u32NmiCount++;

    /* NMI Pin */
    if (Set == NMI_IrqFlgGet(NmiSrcNmi))
    {
        NMI_IrqFlgClr(NmiSrcNmi);
        BSP_LED_Toggle(LED_RED);
        BSP_LED_Toggle(LED_GREEN);
        BSP_LED_Toggle(LED_YELLOW);
        BSP_LED_Toggle(LED_BLUE);
    }

    /* SWDT underflow or refresh */
    if (Set == NMI_IrqFlgGet(NmiSrcSwdt))
    {
        NMI_IrqFlgClr(NmiSrcSwdt);
    }

    /* PVD1 detected */
    if (Set == NMI_IrqFlgGet(NmiSrcVdu1))
    {
        NMI_IrqFlgClr(NmiSrcVdu1);
    }

    /* PVD2 detected */
    if (Set == NMI_IrqFlgGet(NmiSrcVdu2))
    {
        NMI_IrqFlgClr(NmiSrcVdu2);
    }

    /* XTAL stop */
    if (Set == NMI_IrqFlgGet(NmiSrcXtalStop))
    {
        NMI_IrqFlgClr(NmiSrcXtalStop);
    }

    /* SRAM1/2/HS/Ret Parity error */
    if (Set == NMI_IrqFlgGet(NmiSrcSramPE))
    {
        NMI_IrqFlgClr(NmiSrcSramPE);
    }

    /* SRAM3 ECC error */
    if (Set == NMI_IrqFlgGet(NmiSrcSramDE))
    {
        NMI_IrqFlgClr(NmiSrcSramDE);
    }

    /* MPU bus error */
    if (Set == NMI_IrqFlgGet(NmiSrcMpu))
    {
        NMI_IrqFlgClr(NmiSrcMpu);
    }

    /* WDT underflow or refresh */
    if (Set == NMI_IrqFlgGet(NmiSrcWdt))
    {
        NMI_IrqFlgClr(NmiSrcWdt);
    }
}

/**
 *******************************************************************************
 ** \brief Key10 init function
 **
 ** \param  None
 **
 ** \retval None
 **
 ******************************************************************************/
void Key10_Init(void)
{
    stc_exint_config_t stcExtiConfig;
    stc_irq_regi_conf_t stcIrqRegiConf;
    stc_port_init_t stcPortInit;

    /* configuration structure initialization */
    MEM_ZERO_STRUCT(stcExtiConfig);
    MEM_ZERO_STRUCT(stcIrqRegiConf);
    MEM_ZERO_STRUCT(stcPortInit);

    /**************************************************************************/
    /* External Int Ch.1                                                      */
    /**************************************************************************/
    stcExtiConfig.enExitCh = ExtiCh01;

    /* Filter setting */
    stcExtiConfig.enFilterEn = Enable;
    stcExtiConfig.enFltClk = Pclk3Div8;
    stcExtiConfig.enExtiLvl = ExIntBothEdge;
    EXINT_Init(&stcExtiConfig);

    /* Set External Int */
    MEM_ZERO_STRUCT(stcPortInit);
    stcPortInit.enExInt = Enable;
    PORT_Init(KEY10_PORT, KEY10_PIN, &stcPortInit);

    /* Select External Int Ch.1 */
    stcIrqRegiConf.enIntSrc = INT_PORT_EIRQ1;

    /* Register External Int to Vect.No.000 */
    stcIrqRegiConf.enIRQn = Int000_IRQn;

    /* Callback function */
    stcIrqRegiConf.pfnCallback = &ExtInt01_Callback;

    /* Registration IRQ */
    enIrqRegistration(&stcIrqRegiConf);

    /* Clear pending */
    NVIC_ClearPendingIRQ(stcIrqRegiConf.enIRQn);

    /* Set priority */
    NVIC_SetPriority(stcIrqRegiConf.enIRQn, DDL_IRQ_PRIORITY_DEFAULT);

    /* Enable NVIC */
    NVIC_EnableIRQ(stcIrqRegiConf.enIRQn);
}

/**
 *******************************************************************************
 ** \brief Software interrupt init function
 **
 ** \param [in]  pstcSwiConfig          software configure structure
 **
 ** \retval None
 **
 ******************************************************************************/
void SWI_Init(const stc_swi_config_t *pstcSwiConfig)
{
    uint8_t u8SWI_IRQ = 0u, i;
    stc_irq_regi_conf_t stcIrqRegiConf;

    /* configure structure initialization */
    MEM_ZERO_STRUCT(stcIrqRegiConf);

    for (i = 0u; i< 32u; i++)
    {
        if ((uint32_t)(1ul << i) == (pstcSwiConfig->enSwiCh))
        {
            u8SWI_IRQ = i;
            break;
        }
    }

    /* Select software Int Ch.8 */
    stcIrqRegiConf.enIntSrc = (en_int_src_t)(u8SWI_IRQ);

    /* Register software Int to Vect.No.008 */
    stcIrqRegiConf.enIRQn = (IRQn_Type)(u8SWI_IRQ);

    /* Callback function */
    stcIrqRegiConf.pfnCallback = pstcSwiConfig->pfnSwiCallback;

    enIrqRegistration(&stcIrqRegiConf);

    /* Clear Pending */
    NVIC_ClearPendingIRQ(stcIrqRegiConf.enIRQn);

    /* Set priority */
    NVIC_SetPriority(stcIrqRegiConf.enIRQn, DDL_IRQ_PRIORITY_DEFAULT);

    /* Enable NVIC */
    NVIC_EnableIRQ(stcIrqRegiConf.enIRQn);

    /* Enable Software interrupt */
    SWI_Enable(pstcSwiConfig->enSwiCh);
}

/**
 *******************************************************************************
 ** \brief  main function for EXINT, NMI, SWI function
 **
 ** \param  None
 **
 ** \retval int32_t Return value, if needed
 **
 ******************************************************************************/
int32_t main(void)
{
    stc_nmi_config_t stcNmiConfig;
    stc_swi_config_t stcSwiConfig;

    /* configure structure initialization */
    MEM_ZERO_STRUCT(stcNmiConfig);
    MEM_ZERO_STRUCT(stcSwiConfig);

    DDL_PrintfInit(BSP_PRINTF_DEVICE, BSP_PRINTF_BAUDRATE, BSP_PRINTF_PortInit);

