SoCXin/HC32F460/src/hc32f460_ddl_Rev2.0.0/example/ev_hc32f460_lqfp100_v2/exint_nmi_swi/source/main.c
    /* LED initialization */
    BSP_LED_Init();

    /**************************************************************************/
    /* NMI Pin (PB11)                                                         */
    /**************************************************************************/
    /* Filter setting */
    stcNmiConfig.enFilterEn = Enable;
    stcNmiConfig.enFilterClk = Pclk3Div8;

    /* Falling edge */
    stcNmiConfig.enNmiLvl = NmiFallingEdge;

    /* Callback function */
    stcNmiConfig.pfnNmiCallback = &Nmi_IrqCallback;
    stcNmiConfig.u16NmiSrc = NmiSrcNmi;

    NMI_Init(&stcNmiConfig);

    /**************************************************************************/
    /* SWI 31 configuration                                                   */
    /**************************************************************************/
    /* SWI Ch.31 */
    stcSwiConfig.enSwiCh = SwiCh31;

    /* Software interrupt */
    stcSwiConfig.enSwiType = SwInt;

    /* Software interrupt callback function */
    stcSwiConfig.pfnSwiCallback = &SWI31_Callback;

    SWI_Init(&stcSwiConfig);

    /**************************************************************************/
    /* Key10 (ext. interrupt) configuration                                   */
    /**************************************************************************/
    Key10_Init();

    while(1)
    {
        ;
    }
}

/*******************************************************************************
 * EOF (not truncated)
 ******************************************************************************/
